public class Main {
    public static void main(String[] args) {
        int number = 333;
        int result = 0;
        result = (3*16*16) + (3*16) + (3*1);

        System.out.println(result);

    int number1 = 200345;
    int result1 = 0;
    result1 = (2*10*10*10*10*10) + (0*10*10*10*10) + (0*10*10*10) + (3*10*10) + (4*10) + (5*1);
    System.out.println(result1);

    int number2 = 637;
    // 637/16 = 39
    // 637%16 = 13
    // 39/16= 2
    // 39%16 = 7
    // 2/16 = 0
    // 2%16 = 2
    // Результат: 2713, поскольку 13 = D, итоговый ответ: 27D
        System.out.println( "27D");

        int number3 = 637;
        int result3 = 0;
        result3 = (6*16*16) + (3*16) + (7*1);
        System.out.println(result3);

        int number4 = 637;
        // Делим целую часть на 2, остаток записываем в скобках.
        // 637/2 = 318 (1)
        // 318/2 = 159 (0)
        // 159/2 = 79  (1)
        // 79/2 = 39   (1)
        // 39/2 = 19   (1)
        // 19/2 = 9    (1)
        // 9/2 = 4     (1)
        // 4/2 = 2     (0)
        // 2/2 = 1     (0)
        // 1/2 = 0     (1)
        // Записываем остаток в обратном порядке: 1001111101

        System.out.println(1001111101);

        int number5 = 11100111;
        int result5 = 0;
        result5 = (1*2*2*2*2*2*2*2) + (1*2*2*2*2*2*2) + (1*2*2*2*2*2) + (0*2*2*2*2) + (0*2*2*2) + (1*2*2) + (1*2) + (1*1);
        System.out.println(result5);

        int number6 = 637;
        // Делим целую часть на 3, остаток записываем в скобках.
        // 637/3 = 212 (1)
        // 212/3 = 70  (2)
        // 70/3 = 23   (1)
        // 23/3 = 7    (2)
        // 7/3 = 2     (1)
        // 2/3 = 0     (2)
        // Записываем остаток в обратном порядке: 212121

        System.out.println(212121);
        










    }



}